/** ЗАДАЧА 31 - Интервалы и Таймауты
 *
 * Используйте следующие встроенные функции:
 * setTimeout
 * setInterval
 * clearInterval
 *
 * Нужно вывести в консоль ТОЛЬКО 5 сообщений с интервалом 2 секунды:
 * "Сообщение номер 1"
 * "Сообщение номер 2"
 * "Сообщение номер 3"
 * "Сообщение номер 4"
 * "Сообщение номер 5"
 */
let i = 1
const b = 2000
const intervalFx = setInterval(() => {
	console.log(`Сообщение номер ` + i)
	i += 1
}, b)
//Функция setInterval возвращает ID, которое нужно чтобы его остановить. Функция clearInterval просит ID для того чтобы его остановить
const c = b * 5.5
setTimeout(() => clearInterval(intervalFx), c)
