# ============== Основные концепции Python

# Python - обьектно ориентированный язык программирования

# Главная идея Python - все сущности в Python это обьекты

# Обьект - это экземпляр определенного класса
# Класс - это шаблон(прототип) для создания обьекта

# У каждого класса есть атрибуты(свойства)
# Атрибут называется методом если его значение это функция


# ============= ОСНОВНЫЕ ТИПЫ PYTHON

# 1.Строка.   str 'Bogdan'
# 2.Целое число.    int  10
# 3.Логический тип.    bool   True / False
# 4.Список.   list [1, 2, 3]  (как массив в JS)
# 5.Словарь.   dict {'min': 3, 'max': 8} (как обьект в JS но свойства (ключи в python) записываются в ковычках)
