# =====================  ВЫРАЖЕНИЯ
# Результатом выражения является значения. Выражение можно использовать в качестве аргумента в функции


5 + 3  # пример выражения. Результат 8
# a > b  # пример выражения. Результат True или False
'Hello' + 'World'  # пример выражения. Результат одна строка
# Вызов функции в Python тоже выражение так как оно возвращает значение


# ====================== ИНСТРУКЦИИ
# Инструкция выполняет действие. Оно не возвращает значение, его нельзя использовать как аргумент в функции
my_name = 'Dima'  # присвоение значения


# условная инструкция
if my_name:
    print(my_name)

# импортирование модуля
# import datatime
