# Переменные дают возможность к повторному доступу к значению

snake_case = 1  # с помощью подхода snake_case дают имена переменным, функциям, методам, модулям
PascalCase = 1  # используется для имен классов

# my-package = используется для обозначения пакетов
DB_PASSWORD = 1  # так следует обозначать переменные которые не меняются на протяжении работы программы

# Названия переменных должны быть понятными

my_number = 10
# Python - язык с динамической типизацией
# тип любой переменной определяется типом присвоенного значения
